app/Controllers/LoginController.php

    public function attemptLogin()
    {
        $validation = \Config\Services::validation();
        $validation->setRules([
            'email'    => 'required|valid_email',
            'password' => 'required',
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->to('login')->withInput()->with('error', $validation->listErrors());
        }

        $email    = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $this->userModel->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'resilience@gmail.com'
 LIMIT 1