app/Models/UserModel.php

    public function registerUser($email, $username, $phone, $password)
    {
        try {
            // Check if the user with the given email already exists
            $existingUser = $this->where('email', $email)->first();
            if ($existingUser) {
                throw new \Exception('User with this email already exists');
            }

            // Hash the password
            $hashedPassword = password_hash($password, PASSWORD_BCRYPT);

            // Insert user data into the 'users' table
            $data = [
                'email' => $email,
                'username' => $username,
                'phone' => $phone,
                'password' => $hashedPassword,
                // Add other fields as needed
            ];

            $this->insert($data);
---
SELECT *
FROM `users`
WHERE `email` = 'resilience20@gmail.com'
 LIMIT 1
INSERT INTO `users` (`email`, `username`, `phone`, `password`) VALUES ('resilience20@gmail.com', 'Peter', '0122326546', '$2y$10$pr5vIO9sIyuZ2VBBxCsxgOCbRJL7PqtUjJzC7nZRe0SYM9trk.S8y')